[
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "Metin, elektriğin büyük ölçekli güç iletimi ile ilgili olduğunu ima etse de, bu iki kavram arasındaki temel ayrım elektron akışının kontrol mekanizmasında yatmaktadır.",
        "text": "Elektrik, büyük ölçekli güç iletimine odaklanırken, elektronik küçük ölçekli sinyal işlemedir."
      },
      {
        "isCorrect": true,
        "rationale": "Metinde açıkça belirtildiği üzere, 'Elektrik, iletkenlerdeki elektrik yükü akışına odaklanırken, elektronik yarı iletkenlerdeki ve diğer malzemelerdeki elektron akışını kontrol etmekle ilgilenir.'",
        "text": "Elektrik, iletkenlerdeki elektron akışıyla ilgilenirken, elektronik yarı iletkenlerdeki elektron akışının kontrolüyle ilgilenir."
      },
      {
        "isCorrect": false,
        "rationale": "Hem elektrik hem de elektronik enerji üretimi ve dönüşümüyle ilgili alanlardır; bu, aralarındaki en belirgin farkı temsil etmez.",
        "text": "Elektrik, enerjinin üretimi ve tüketimiyle, elektronik ise enerji dönüşümüyle ilgilidir."
      },
      {
        "isCorrect": false,
        "rationale": "Bu ifade yanlıştır; elektronik cihazlar genellikle AC'yi DC'ye dönüştürerek kullanır ve hem elektrik hem de elektronik kavramları her iki akım tipini de kapsar.",
        "text": "Elektrik, doğru akımla çalışırken, elektronik yalnızca alternatif akımı kullanır."
      }
    ],
    "question": "Elektrik ve elektronikteki temel odak noktaları arasındaki en belirgin fark, metne göre nasıl tanımlanır?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "Metin, AC'nin voltaj seviyeleri veya cihaz devrelerine zarar verme potansiyeli hakkında bilgi vermemektedir. AC, genellikle yüksek voltajda iletilir.",
        "text": "AC, cihazların içindeki devrelerin zarar görmesini engellemek için daha düşük voltaj sağlar."
      },
      {
        "isCorrect": true,
        "rationale": "Metinde 'Doğru Akım (DC) öncelikle elektronik cihazlarda ve devrelerde kullanılır' denilmektedir. Ayrıca, diyotların AC'yi DC'ye dönüştürdüğü ve güç kaynaklarında kullanıldığı belirtilmiştir, bu da DC'nin hassas elektronik cihazlar için daha uygun ve kararlı bir akım formu olduğunu ima eder.",
        "text": "DC, elektronik cihazlarda daha kararlı ve tek yönlü bir elektron akışı sağlayarak hassas devreler için daha uygun olduğu için."
      },
      {
        "isCorrect": false,
        "rationale": "Metinde AC'nin uzun mesafeli iletimdeki verimliliğinden bahsedilse de, cihazların soğutma sistemlerini zorladığına dair bir bilgi bulunmamaktadır.",
        "text": "AC, uzun mesafeli iletim için daha verimli olsa da, cihazların soğutma sistemlerini zorlar."
      },
      {
        "isCorrect": false,
        "rationale": "Güç adaptörleri AC'yi DC'ye dönüştürür, ancak bunu yüksek frekanslı sinyallere dönüştürmek pil şarjı ile ilgili birincil neden değildir. Amaç, cihaza uygun DC gücü sağlamaktır.",
        "text": "Güç adaptörleri, cihazın pilini hızlı şarj etmek için AC'yi yüksek frekanslı sinyallere dönüştürür."
      }
    ],
    "question": "Evlerde kullanılan elektrik genellikle alternatif akım (AC) olmasına rağmen, akıllı telefonlar gibi birçok elektronik cihaz neden güç adaptörleri aracılığıyla dahili olarak doğru akıma (DC) dönüştürme ihtiyacı duyar?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": true,
        "rationale": "Metin, elektriğin doğada var olan bir olgu olduğunu (statik elektrik gibi) ve Thales tarafından keşfedildiğini; ancak elektrik bataryası, yıldırımsavar, ampul ve AC sistemi gibi pratik uygulamaların daha sonra icat edildiğini vurgulamaktadır.",
        "text": "Elektrik doğal bir fenomen olduğu için sadece gözlemlendi, ancak pratik uygulamaları sonradan icat edildi."
      },
      {
        "isCorrect": false,
        "rationale": "Metin, Thales'in statik elektriği 'keşfettiğini' belirtir, icat ettiğini değil. İcatlar daha sonraki bilim insanları tarafından yapılmıştır.",
        "text": "Antik Yunan'da Thales'in elektriği icat ettiği, modern dünyada ise sadece geliştirildiği."
      },
      {
        "isCorrect": false,
        "rationale": "Bu ifade, elektriğin icat edilmemiş olmasının nedenini net bir mucidinin olmamasına bağlar ki metnin ana vurgusu bu değildir; daha ziyade, elektriğin temel bir doğal kuvvet olduğu vurgulanır.",
        "text": "Elektriğin mucidi net bir şekilde belirlenemediği için bu ifade kullanılmıştır."
      },
      {
        "isCorrect": false,
        "rationale": "Tesla ve Edison'un sistemleri icat ettiği doğru olsa da, bu şık 'elektrik icat edilmedi, keşfedildi' ifadesinin arkasındaki genel ayrımı tam olarak açıklamaz.",
        "text": "Nikola Tesla ve Thomas Edison, elektriği değil, sadece AC ve DC sistemlerini icat ettiler."
      }
    ],
    "question": "Metinde 'Elektrik 'icat edilmedi', aksine keşfedildi' ifadesiyle ne anlatılmak istenmektedir ve bu, elektrik tarihiyle ilgili hangi önemli ayrımı vurgular?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": true,
        "rationale": "Metin, bakır gibi metallerin 'mükemmel iletkenler' olduğunu ve akımın kolayca akmasına izin verdiğini belirtir. Kauçuk ve plastik gibi malzemelerin ise 'dirençli' olduğunu ve 'istenmeyen akımın kaçmasını önleyerek güvenliği sağladığını' açıklar.",
        "text": "Bakır, akımın rahatça akmasını sağlayarak enerjiyi verimli iletirken, kauçuk dışarıya akımı engelleyerek şok riskini azaltır."
      },
      {
        "isCorrect": false,
        "rationale": "Bu özellikler doğru olsa da, kablo seçiminin birincil nedeni metinde belirtilen elektrik iletkenliği ve direnç özellikleriyle ilgili güvenlik amaçlıdır.",
        "text": "Bakır kabloyu daha hafif yapar, kauçuk ise kablonun esnekliğini artırır."
      },
      {
        "isCorrect": false,
        "rationale": "İzolasyonun amacı, voltaj seviyesine bakılmaksızın akımın dışarı sızmasını önlemektir. Kauçuk sadece düşük voltajlar için değil, geniş bir yelpazede yalıtım sağlar.",
        "text": "Bakır, yüksek voltajları taşırken, kauçuk düşük voltajları izole etmek için kullanılır."
      },
      {
        "isCorrect": false,
        "rationale": "Bakırın iyi bir ısı iletkeni olması ve yalıtkanların ısınmayı önlemesi doğru olabilir ancak metindeki bağlamda kablo malzemesi seçiminin birincil nedeni direnç ve elektrik güvenliğiyle ilişkilidir.",
        "text": "Bakır ısıyı iyi dağıtır, kauçuk ise kablonun aşırı ısınmasını önler."
      }
    ],
    "question": "Metinde direncin tanımı ve bazı malzemelerin direnç seviyeleri verilmiştir. Buna göre, elektrik güvenliği açısından bir elektrikli aletin kablosunda neden bakır iletkenler kullanılırken, dış kaplamasında kauçuk veya plastik gibi malzemeler tercih edilir?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "Seri devrede bileşenler uca bağlıdır ve akım sıralı akar. Bu durumda bir lambanın arızalanması, tüm devrenin açık devre olmasına ve diğer lambaların da sönmesine neden olur.",
        "text": "Seri devre; tüm bileşenler uca eklenir, böylece akım tüm bileşenlerden sıralı olarak akar."
      },
      {
        "isCorrect": true,
        "rationale": "Metin, paralel devrelerde 'akımın birden fazla yoldan akmasına izin verildiğini' belirtir. Bu, bir bileşenin arızalanması durumunda diğerlerinin çalışmaya devam etmesini sağlayan özelliktir.",
        "text": "Paralel devre; bileşenler paralel bağlanır, akımın birden fazla yoldan akmasına izin verir."
      },
      {
        "isCorrect": false,
        "rationale": "Metinde 'Hibrid devre' kavramından bahsedilmemektedir.",
        "text": "Hibrid devre; hem seri hem de paralel özellikleri birleştirir."
      },
      {
        "isCorrect": false,
        "rationale": "Bu, bir devrenin genel tanımıdır ve tüm lambaların bağımsız çalışması veya birinin arızalanması durumunda diğerlerinin etkilenmemesi özelliğini açıklamaz. Hem seri hem de paralel devreler 'kapalı devre' olabilir.",
        "text": "Kapalı devre; akımın bir güç kaynağından başlayıp geri dönmesini sağlayan bir yoldur."
      }
    ],
    "question": "Bir evdeki tüm lambaların aynı anda yanmasını veya sönmesini sağlayan ve bir lambanın arızalanması durumunda diğerlerinin çalışmaya devam etmesine izin veren devre tipinin metindeki tanımı ve temel özelliği nedir?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "AC'yi DC'ye dönüştürme yeteneği öncelikli olarak diyotların işlevidir, transistörlerin değil.",
        "text": "AC'yi DC'ye dönüştürme yeteneği sayesinde güç kaynaklarında yaygın olarak kullanılması."
      },
      {
        "isCorrect": true,
        "rationale": "Metin, transistörün 'elektronik sinyalleri yükseltmek veya anahtarlamak için kullanılan bir yarı iletken cihaz' olduğunu ve 'dijital mantık devrelerinin, amplifikatörlerin ve mikroişlemcilerin yapı taşları' olduğunu açıkça belirtir. Bu, modern elektronikteki merkezi rolünü açıklar.",
        "text": "Elektronik sinyalleri yükseltme veya anahtarlama yeteneğiyle dijital mantık devreleri ve mikroişlemcilerin temelini oluşturması."
      },
      {
        "isCorrect": false,
        "rationale": "Bu özellik, entegre devrelerin (IC'lerin) temel özelliğidir; transistörler IC'lerin içinde yer alan bileşenlerdir.",
        "text": "Çok sayıda bileşenin tek bir yonga üzerinde birleştirilmesine olanak sağlaması."
      },
      {
        "isCorrect": false,
        "rationale": "Metinde transistörlerin bu spesifik yeteneğinden bahsedilmemektedir. Ana işlevleri yükseltme ve anahtarlamadır.",
        "text": "Sinyallerdeki gürültüyü filtreleyerek analog devrelerin performansını iyileştirmesi."
      }
    ],
    "question": "Metne göre, transistörün modern elektronik cihazlardaki 'en önemli' bileşen olarak kabul edilmesinin temel nedeni nedir?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "Analog devreler sürekli sinyallerle çalıştığı için belirli voltaj seviyeleriyle sınırlı değildir; aksine, voltajın herhangi bir değerini temsil edebilirler.",
        "text": "Sürekli sinyallerle çalıştıkları için yalnızca belirli voltaj seviyelerini işleyebilmeleri."
      },
      {
        "isCorrect": false,
        "rationale": "Metinde analog ve dijital devreler arasındaki güç tüketimi farkına dair doğrudan bir bilgi bulunmamaktadır.",
        "text": "Güç tüketimlerinin dijital devrelere göre her zaman daha yüksek olması."
      },
      {
        "isCorrect": true,
        "rationale": "Metinde 'Ancak, analog sinyaller istenmeyen sinyaller olan gürültüden kolayca etkilenebilir' ifadesiyle bu zayıflık açıkça belirtilmiştir. Dijital devreler, ayrık sinyaller sayesinde gürültüye karşı daha dayanıklıdır.",
        "text": "Gürültüden (istenmeyen sinyallerden) kolayca etkilenmeleri, bu durumun sinyal kalitesini düşürmesi."
      },
      {
        "isCorrect": false,
        "rationale": "Bu şık, dijital devrelerin bir özelliğidir, analog devrelerin bir zayıflığı değildir. Analog devreler, gerçek dünya verilerini doğrudan temsil edebilir.",
        "text": "Sadece 0 ve 1 gibi ayrık değerlerle çalışarak gerçek dünya verilerini doğrudan temsil edememeleri."
      }
    ],
    "question": "Analog devrelerin metinde belirtilen temel zayıflığı nedir ve bu durum dijital devrelere kıyasla neden önemli bir fark yaratır?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "Transistörler bağlantı noktaları değildir; IC'leri güç kaynağına bağlamak için kullanılanlar pinlerdir (leads).",
        "text": "Transistörler, IC'leri bir güç kaynağına bağlamak için kullanılan bağlantı noktalarıdır."
      },
      {
        "isCorrect": true,
        "rationale": "Metin, 'Entegre devreler, çok sayıda elektronik bileşenin (transistörler, diyotlar, dirençler vb.) küçük bir yarı iletken malzeme yongası üzerine gömülmesiyle oluşan bir koleksiyondur' ve 'milyarlarca transistör içeren karmaşık mikroişlemcilere kadar değişebilir' ifadeleriyle bu ilişkiyi ve rolü açıkça ortaya koymaktadır.",
        "text": "IC'ler, milyarlarca transistör de dahil olmak üzere çok sayıda elektronik bileşenin tek bir yarı iletken çip üzerine entegre edilmesiyle oluşturulur ve böylece karmaşık işlevleri kompakt bir yapıda yerine getirir."
      },
      {
        "isCorrect": false,
        "rationale": "Transistörler hem yükseltme hem de anahtarlama yapar. IC'ler ise yalnızca anahtarlama değil, çok daha karmaşık işlevleri yerine getirebilir.",
        "text": "Transistörler sadece sinyal yükseltmek için kullanılırken, IC'ler sadece sinyal anahtarlaması yapar."
      },
      {
        "isCorrect": false,
        "rationale": "Akımın tek yönde akmasını sağlayan cihazlar diyotlardır, IC'ler değil.",
        "text": "IC'ler, transistörlerin aksine, akımın sadece tek yönde akmasını sağlayan cihazlardır."
      }
    ],
    "question": "Entegre devreler (IC'ler) ve transistörler arasındaki ilişkiyi ve IC'lerin modern elektronikteki rolünü metne göre en doğru şekilde açıklayan ifade hangisidir?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "Yarı iletkenler elektriği tamamen bloke etmez; belirli koşullar altında iletebilirler. Tamamen bloke etmek yalıtkanların özelliğidir.",
        "text": "Elektriği tamamen bloke ederek güvenlik sağlamaları."
      },
      {
        "isCorrect": true,
        "rationale": "Metin, yarı iletkenlerin 'iletkenliği yalıtkanlar ve iletkenler arasında olan' malzemeler olduğunu ve 'belirli koşullar altında elektrik iletecek şekilde kontrol edilebildiğini' belirtir. Bu kontrol edilebilir iletkenlik, onları modern elektronik bileşenlerin temelini oluşturur.",
        "text": "İletkenliklerinin, yalıtkanlar ve iletkenler arasında olması ve belirli koşullar altında elektrik iletecek şekilde kontrol edilebilmeleri."
      },
      {
        "isCorrect": false,
        "rationale": "Yarı iletkenler, AC'yi DC'ye dönüştüren diyotlar gibi önemli bileşenlerin temelidir, bu da onların her iki akım tipiyle de ilişkili olduğunu gösterir.",
        "text": "Sadece doğru akım (DC) ile çalışabilmeleri ve alternatif akımı (AC) reddetmeleri."
      },
      {
        "isCorrect": false,
        "rationale": "LED'ler (Light-Emitting Diodes) yarı iletkenlerden yapılmıştır, ancak bu, yarı iletkenlerin 'modern elektronik bileşenlerin temeli' olmasının tek veya ana nedeni değildir. Transistörler ve IC'ler gibi diğer bileşenlerin de temelidirler.",
        "text": "Yalnızca ışık yayarak (LED gibi) görüntüleme teknolojilerinde kullanılmaları."
      }
    ],
    "question": "Yarı iletkenlerin, metinde belirtildiği gibi 'modern elektronik bileşenlerin temelini oluşturması' ifadesiyle kastedilen ana özelliği nedir ve bu, elektronik cihazların işleyişi için neden hayati öneme sahiptir?"
  },
  {
    "answerOptions": [
      {
        "isCorrect": false,
        "rationale": "P = V × I formülüne göre, aynı voltajda daha yüksek akım veya aynı akımda daha yüksek voltaj daha yüksek güç anlamına gelir. Bu da genellikle daha fazla enerji tüketimi demektir, daha az değil.",
        "text": "Cihazın daha az enerji tüketerek daha uzun süre çalışması."
      },
      {
        "isCorrect": true,
        "rationale": "Metin açıkça 'Güç ne kadar yüksek olursa, zaman içinde o kadar fazla enerji kullanılır' ifadesini kullanır. Bu, gücün enerjinin tüketim veya üretim hızı olduğunu belirtir.",
        "text": "Cihazın belirli bir sürede daha fazla elektrik enerjisi tüketmesi veya üretmesi."
      },
      {
        "isCorrect": false,
        "rationale": "Yüksek güç, genellikle daha fazla ısı üretimi ile ilişkilidir (örneğin, P = I²R). Düşük direnç, aynı voltajda daha yüksek akım ve dolayısıyla daha yüksek güç anlamına gelebilir.",
        "text": "Cihazın daha düşük dirençle çalışması ve dolayısıyla daha az ısı üretmesi."
      },
      {
        "isCorrect": false,
        "rationale": "Güç, elektronların hareket hızıyla doğrudan ilişkili değildir; daha ziyade, birim zamanda harcanan veya üretilen enerji miktarıyla ilgilidir.",
        "text": "Cihazın elektronları daha yavaş hareket ettirmesi."
      }
    ],
    "question": "Bir devredeki voltaj (V) ve akım (I) değerleri bilindiğinde, metinde belirtilen güç (P) formülüne (P = V × I) göre, bir cihazın yüksek güce sahip olmasının temel anlamı nedir?"
  }
]